Ran Plan for 2 projects:

1. dir: `example/actions/terraform` workspace: `default`
1. dir: `example/tfbackend` workspace: `default`
---

### 1. dir: `example/actions/terraform` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_policy.s3_access will be created
+ resource "aws_iam_policy" "s3_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "cn-practice-actions-runner-s3-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "owner"   = "mori"
          + "project" = "cn-practice"
        }
    }

  # aws_iam_role_policy_attachment.actions_runner_s3_access will be created
+ resource "aws_iam_role_policy_attachment" "actions_runner_s3_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cn-practice-actions-runner-role"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d example/actions/terraform
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http:/lock?id=cnc4e%252Fcloudnative-practice%252Fexample%252Factions%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d example/actions/terraform
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 2. dir: `example/tfbackend` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d example/tfbackend
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http:/lock?id=cnc4e%252Fcloudnative-practice%252Fexample%252Ftfbackend%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d example/tfbackend
  ```

---
### Plan Summary

2 projects, 1 with changes, 1 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```